from app.api.v1.schemas.cif import RelationshipResponse


########################################################################################################################
# Response
########################################################################################################################
# Thông tin chi tiết người giám hộ hoặc người có quan hệ với khách hàng qua mã CIF
# Response Model kế thừa từ RelationshipResponse (Model dùng chung)
class DetailRelationshipResponse(RelationshipResponse):
    pass

########################################################################################################################
# Request Body
########################################################################################################################
